fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CommonModules/ВКМ_ДоработкаДокументаРеализацияТоваровИУслугСервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция проверяет наличие сущиствующего докумета с данными предлагаемые к записи// Находит существующий проведенный документ реализации товаров и услуг за период с теми же реквизитами и услугами (абонентская плата или работы специалиста)
//
// Параметры:
//   ТекущийОбъект - ДокументОбъект.РеализацияТоваровУслуг - проверяемый объект документа
//
// Возвращаемое значение:
//   ДокументСсылка.РеализацияТоваровУслуг - ссылка на найденный документ
//   - Неопределено - если документ не найден
Функция НайтиСуществующийДокументРеализацияСДаннымиТекущегоОбъекта(ТекущийОбъект) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		|ГДЕ
		|	РеализацияТоваровУслугУслуги.Ссылка.Дата >= &ДатаНачалаПериода
		|	И РеализацияТоваровУслугУслуги.Ссылка.Дата <= &ДатаОкончанияПериода
		|	И РеализацияТоваровУслугУслуги.Номенклатура В
		|			(ВЫБРАТЬ
		|\t\t\t\tВКМ_НоменклатураАбонентскаяПлата.Значение КАК Номенклатура
		|			ИЗ
		|\t\t\t\tКонстанта.ВКМ_НоменклатураАбонентскаяПлата КАК ВКМ_НоменклатураАбонентскаяПлата
		|		
		|			ОБЪЕДИНИТЬ ВСЕ
		|		
		|			ВЫБРАТЬ
		|\t\t\t\tВКМ_НоменклатураРаботыСпециалиста.Значение
		|			ИЗ
		|\t\t\t\tКонстанта.ВКМ_НоменклатураРаботыСпециалиста КАК ВКМ_НоменклатураРаботыСпециалиста)
		|	И РеализацияТоваровУслугУслуги.Ссылка.Договор = &Договор
		|	И РеализацияТоваровУслугУслуги.Ссылка <> &Ссылка
		|	И РеализацияТоваровУслугУслуги.Ссылка.Проведен
		|\tИ РеализацияТоваровУслугУслуги.Ссылка.Договор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
		|	И РеализацияТоваровУслугУслуги.Ссылка.Контрагент = &Контрагент
		|	И РеализацияТоваровУслугУслуги.Ссылка.Организация = &Организация";
	
	Запрос.УстановитьПараметр("ДатаНачалаПериода", НачалоМесяца(ТекущийОбъект.Дата));
	Запрос.УстановитьПараметр("ДатаОкончанияПериода", КонецМесяца(ТекущийОбъект.Дата));
	Запрос.УстановитьПараметр("Договор", ТекущийОбъект.Договор); 
	Запрос.УстановитьПараметр("Контрагент", ТекущийОбъект.Контрагент);
    Запрос.УстановитьПараметр("Организация", ТекущийОбъект.Организация);
   	Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка); 
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	Иначе 
		
		Возврат Неопределено;
		
	КонецЕсли;
		
КонецФункции

// Проверяет правильность заполнения документа РеализацияТоваровУслуг:
// указан договор, договор имеет вид "Абонентское обслуживание" и действует на дату документа.
//
// Параметры:
//   Объект - ДокументОбъект.РеализацияТоваровУслуг - документ реализации товаров и услуг
//
// Возвращаемое значение:
//   Булево - Истина, если документ заполнен верно, Ложь в противном случае
// Проверка правильности заполнения документа РеализацияТоваровУслуг
Функция ДокументРеализацииТоваровИУслугЗаполненВерно(Знач Объект) Экспорт
	
	Если  Не ЗначениеЗаполнено(Объект.Договор) Тогда	
		
		ТекстСообщения = "Ошибка. Не указан договор";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Объект.Ссылка,"Объект.Договор","Объект.Договор");
		Возврат Ложь;

	КонецЕсли; 
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор,"ВидДоговора") <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		
		ТекстСообщения = "Должен быть договор абонентского обслуживания";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.Договор");
		Возврат Ложь;
		
	КонецЕсли;  
		
	ДатаНачалИДатаОкончанияДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор,"ВКМ_ДатаНачалаДействияДоговора,ВКМ_ДатаОкончанияДействияДоговора");
Если ДатаНачалИДатаОкончанияДоговора.ВКМ_ДатаНачалаДействияДоговора > Объект.Дата 
	Или   ДатаНачалИДатаОкончанияДоговора.ВКМ_ДатаОкончанияДействияДоговора < Объект.Дата Тогда
					
		ТекстСообщения = "Выбранный договор не дейстителен на дату документа.
						|Создание документа реализации товаров и услуг невозможно. ";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.Договор");
		Возврат Ложь;		 
		
	КонецЕсли; 

	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьДополнительныеЭлементыФормы(Форма)Экспорт
	
	КомандаЗаполнить = Форма.Команды.Добавить("Заполнить");
	КомандаЗаполнить.Действие = "ВКМ_ВыполнитьКомандуЗаполнить";
	КомандаЗаполнить.Заголовок = "Заполнить"; 
	
	КнопкаЗаполнить = Форма.Элементы.Добавить("КнопкаСформироватьТаблицу", Тип("КнопкаФормы"), Форма.Элементы.ФормаКоманднаяПанель);
	КнопкаЗаполнить.ИмяКоманды = "Заполнить"; 
	
	Форма.Элементы.Страницы.ТекущаяСтраница = Форма.Элементы.ГруппаУслуги
		
КонецПроцедуры


#КонецОбласти
